Repository: KillerBoogie/ef-core-join-query-bug
Catalog: VC.WebApi/Infrastructure/Errors/ErrorDetail.*.resx
Languages: de

# Phone_Public_Part_Max_Length_Exceeded
source: The maximum length of a phone number without extension is {0} digits plus an optional leading '+' sign.
de: Die maximale Länge einer Telefonnummer ohne Durchwahl ist {0} Ziffern plus ein optionales führendes '+' Zeichen.

# Invalid_Language
source: The Language '{0}' is not valid.
de: Die Sprache '{0}' ist keine gültige Sprache.

# Invalid
source: invalid value for '{0}'.
de: ungültiger Wert für '{0}'.

# Max_Char_Length_Exceeded
source: {0} is too long. The maximum length is {1} characters.
de: {0} ist zu lang. Die maximale Länge beträgt {1} Zeichen.

# Invalid_Guid
source: {0} is not a valid Guid.
de: {0} ist keine gültige Guid.

# Date_Cant_Be_Before_Min_Date
source: Date can't be before {0}.
de: Das datum kann nicht vor {0} sein.

# Date_Cant_Be_In_Future
source: {0} can't be in the future.
de: {0} kann nicht in der Zukunft liegen.

# Length_Out_Of_Range
source: {0} must be between {1} and {2} characters.
de: {0} muss zwischen {1} und {2} Zeichen lang sein.

# Max_Digit_Length_Exceeded
source: {0} is too long. The maximum length is {1} digits.
de: {0} ist zu lang. Die maximale Länge beträgt {1} Zeichen.

# Min_Char_Length_Deceeded
source: {0} is too short. The minimum length is {1} characters.
de: {0} ist zu kurz. Die minimale Länge beträgt {1} Zeichen.

# Must_Not_Be_Empty
source: '{0}' must not be empty.
de: {0} darf nicht leer sein.

# Only_Digits
source: {0} may consists of digits only.
de: {0} darf nur aus Ziffern bestehen.

# Min_Digit_Length_Deceeded
source: {0} is too short. The minimum length is {1} digits.
de: {0} ist zu kurz. Die minimale Länge beträgt {1} Ziffer(n).

# Affected_Rows
source: The number of affected rows for {0} with id [{1}] should be {2}, but was {3}.
de: Die Anzahl der betroffenen Zeilen The number of affected rows for {0} with ID [{1}] should be {2}, but was {3}.

# Exists_With_Id
source: {0} with id [{1}] exists already.
de: {0} mit der ID [{1}] ist bereits vorhanden.

# Id_Not_Found
source: Could not find {0} with id '{1}'.
de: {0} mit der ID '{1}' konnte nicht gefunden werden.

# Not_Successful
source: {2} for {0} with id [{1}] was not successful.
de: {2} für {0} mit ID [{1}] war nicht erfolgreich.

# Phone_Country_Code_Invalid
source: The country code may only consist of a maximum of {0} digits and an optional leading '+' sign.
de: Der Ländercode kann maximal aus {0} Ziffern und einem optionalen führenden '+' Zeichen bestehen.

# At_Least_One_Lowercase_Character
source: {0} must include at least one lowercase character.
de: {0} muss mindestens einen Kleinbuchstaben enthalten.

# At_Least_One_Number
source: {0} must include at least one number.
de: {0} muss mindestens eine Ziffer enthalten.

# At_Least_One_Special_Character
source: {0} must include at least one special character.
de: {0} muss mindestens ein Sonderzeichenenthalten.

# At_Least_One_Uppercase_Character
source: {0} must include at least one uppercase character.
de: {0} muss mindestens einen Großbuchstaben enthalten.

# Char_Length_Incorrect
source: {0} must have exactly {1} characters.
de: {0} muss aus genau {1} Zeichen bestehen.

# Database_Not_Available
source: The database is not available.
de: Die Datenbank ist nicht verfügbar.

# Failed_Unexpectedly
source: The operation failed unexpectedly.
de: Die Operation ist unerwartet fehlgeschlagen.

# Modified_By_Other_User
source: {0} has been modified by another user.
de: {0} wurde von einem anderen Benutzer verändert.

# Must_Be_Empty
source: '{0}' must be empty.
de: '{0}' muss leer sein.

# Invalid_Date
source: '{0}' is not recognized as a date.
de: {0} ist kein gültiges Datum.

# Route_ID_Not_Match_DTO_ID
source: Value of HTTP-Route id does not match value of DTO.Id.
de: Der ID-Wert der HTTP-Route stimmt nicht mit ID-Wert im DTO überein.

# Invalid_Regex
source: {0} is not a valid Regex expression. Details: {1}
de: {0} ist kein gültiger Regex-Ausdruck. Details: {1}

# Max_Decimal_Places_Exceeded
source: The value exceeds the precision. The maximum number of decimal places is {0}.
de: Der Wert übersteigt die Präzision. Die maximale Anzahl an Dezimalstellen beträgt {0}.

# Max_Value_Exceeded
source: The value of {0} exeeds the maximum of {1}.
de: Der Wert von {0} übersteigt das Maximum von {1}.

# Min_Value_Deceeded
source: The value is smaller than the minimum of {0}.
de: Der Wert ist kleiner als das Minimum von {0}.

# Invalid_Value
source: This is not a valid value for '{0}'
de: Dies ist kein gültiger Wert für '{0}'.

# No_Leading_Or_Trailing_Space
source: {0} can't have any leading or trailing space characters.
de: {0} kann keine führenden oder folgenden Leerzeichen haben.

# Not_Only_Whitespace
source: {0} can't contain only whitespace.
de: {0} kann nicht nur Leerzeichen enthalten.

# Must_Be_Pos_Int
source: '{0}' must be a positive integer.
de: '{0}' muss eine positive ganze Zahl sein.

# Duplicate_Values
source: '{0}' has duplicates for values '{1}'.
de: '{0}' hat Duplikate für die Werte '{1}'.

# Must_Be_Zero
source: '{0}' must be zero.
de: '{0}' muss Null sein.

# Must_Not_Be_Zero
source: {0} can't be zero.
de: {0} kann nicht Null sein.

# Required
source: {0} is required.
de: {0} ist erforderlich.

# FromDate_Must_Be_Before_UntilDate
source: The from date '{0}' must be before the until date '{1}'.
de: Das Von-Datum '{0}' muss vor dem Bis-Datum '{1}' liegen.

# FromDate_Or_UntilDate_Must_Be_Not_Null
source: The from date or the until date must have a valid value.
de: Das Von-Datum oder das Bis-Datum muss einen gültigen Wert enthalten.

# Must_Be_Pos_Int_Or_Zero
source: '{0}' must be a positive integer or null.
de: '{0}' muss eine positive ganze Zahl oder Null sein.

# Invalid_System_Language
source: '{0}' is not a valid system language.
de: '{0}' ist keine gültge Systemsprache.

# Not_Found
source: Could not find {0}.
de: {0} konnte nicht gefunden werden.

# No_Permission_For_Command
source: You don't have permission for this command.
de: Der Nutzer hat keine Berechtigung für diesen Befehl.

# No_Permission_For_Field
source: You don't have permission to access the field(s) '{0}'.
de: Keine Berechtigung für das/die Feld(er) '{0}'.

# No_Permission_For_Object
source: You don't have permission to access the object '{0}'.
de: Keine Berechtigung für das Objekt '{0}'.

# No_Permission_For_Request
source: You don't have permission for this request.
de: Fehlende Berechtigung für die Anfrage.

# Request_Body_Requires_At_Least_One_Field
source: The request body requires at least one field.
de: Der Request Body muss mindestens ein Feld enthalten.

# Update_Data_Missing
source: Update data is mising.
de: Daten für Update fehlen.

# A_Or_B_Required
source: "One of two values is required":"{0} or {1} is required."
de: {0} oder {1} ist erforderlich.

# Page_Not_Found
source: Could not find the requested page.
de: Die angeforderte Seite konnte nicht gefunden werden.

# Unpaged_Request_Must_Not_Have_PageNumber_Or_PageSize_Params
source: Unpaginated request with paged = false must not have a 'pageNumber' or 'pageSize' query paramater.
de: Nicht paginierte Requests mit paged = false dürfen keine 'pageNumber' oder 'pageSize' Queryparameter haben.

# AllLangauages_Request_Must_Not_Have_Language_Params
source: Requests with 'allLanguages' query parameter must not have 'language' query paramaters.
de: Requests mit 'allLanguage' Queryparameter dürfen keine 'language' Queryparameter haben.

# Hour_Ambigiush
source: The hour exists twice, because the clock was turned back. You need to specifiy if the hour belongs to the first (A) or the second (B) period.
de: Die Stunde gibt es zweimal, weil die Uhr zurückgedreht wurde. Sie müssen angeben, ob die Stunde zur ersten (A) oder zur zweiten (B) Periode gehört.

# Hour_Skipped
source: The hour does not exists, because the clock was turned forward, e.g. by a change to daylight savings time or a general time change for that zone.
de: Die angegebene Stunde gibt es nicht, weil die Uhr vorgestellt wurde, z. B. durch eine Umstellung auf Sommerzeit oder eine allgemeine Zeitumstellung für diese Zone.

# TimeDiscriminator_Not_Valid
source: The specified hour discriminator ({0}) is not valid for local time.
de: Die angegebene Spezifizierung ({0}) für die Stunde ist für diese lokale Zeit ungültig.

# No_Permission_For_Object_Fields
source: You don't have permission to access the fields of object '{0}'.
de: Keine Berechtigung für die Felder des Objekts '{0}'.

# ML_Cant_Remove_Language_Does_Not_Exists
source: The value could not be removed. It does not exist in language '{0}'.
de: Der Wert konnte nicht erntfernt werden. Er existiert nicht in der Sprache '{0}'.

# ML_Cant_Remove_Language_Requires_At_Least_One_Language
source: The value can't be removed in language {0}. A value is required in at least one language.
de: Der Wert kann in der Sprache '{0}' nicht entfernt werden. Ein Wert in mindestens einer Sprache ist erforderlich.

# ML_Language_Does_Not_Exists
source: The value does not exist in language '{0}'.
de: Der Wert exisitiert nicht in der Sprache '{0}'.

# ML_Requires_At_Least_One_Language
source: {0} requires a value in at least one language.
de: {0} erfordert einen Wert in mindestens einer Sprache.

# Invalid_Uri
source: {0} is not a valid URI.
de: '{0}' ist keine gültige URI.

source: Not Authenticated
de: Nicht authentifiziert

# Not_Found_Resource_With_Id
source: The resource '{0}' with Id '{1}' was not found.
de: Die Resource '{0}' mit Id '{1}' wurde nicht gefunden.

# Required_Field
source: The Field '{0}' is required.
de: Das Feld '{0}' ist erforderlich.

# Required_Parameter
source: The parameter '{0}' is required.
de: Der Parameter '{0}' ist erforderlich.

# Delete_Foreign_Key_Violation
source: Foreign key constraint violation. Referenced table: {0} Constraint name: {1} Command: {2}
de: Verletzung der Fremdschlüssel-Einschränkung. Referenztabelle: {0} Einschränkungsname: {1} Kommando: {2}

# Unique_MLValue_Required
source: The attribute '{0}' contains already a value '{1}' in the language '{2}'.
de: Das Attribut '{0}' enthält bereits einen Wert '{1}' in der Sprache '{2}'.

# Unique_Value_Required
source: The attribute '{0}' contains already a value '{1}'.
de: Das Attribut '{0}' enthält bereits einen Wert '{1}'.

# No_Deletion_For_Linked_Resource
source: The resource '{0}' can't be deleted, because it is referenced by the resource '{1}'.
de: Die Ressource '{0}' kann nicht gelöscht werden, weil sie von der Ressource '{1}' referenziert wird.

# Resource_Not_Found_At_Uri
source: The resource '{0}' can't be found at URI '{1}'.
de: Die Resource '{0}' kann unter der angegebenen URI '{1}' nicht gefunden oder geladen werden.

# Resource_At_Uri_Cant_Be_Read
source: The resource '{0}' at URI '{1}' can't be read.
de: Die Resource '{0}' bei URI '{1}' kann nicht gelesen werden.

# Invalid_RGBA_Format
source: The input string '{0}' is not in the correct RGBA format.
de: Die EIngabezeichenfolge '{0}' hat kein gültiges RGBA-Format.

source: Uploaded file is empty.
de: Die hochgeladene Datei ist leer.

# Not_a_Valid_MultiLanguage_Json_Format
source: The value of '{0}' is not a valid JSON format for multi-language text. Example: {{"de":"German","en":"English"}}.
de: Der Wert von '{0}' ist kein gültiges JSON Format für mehrsprachigen Text. Beispiel: {{"de":"German","en":"English"}}.

# No_File_Uploaded
source: No file was uploaded.
de: Es wurde keine Datei hochgeladen.

# Uploaded_File_X_Is_Empty
source: Uploaded file is empty.
de: Die hochgeladene Datei ist leer.

# Not_An_Accepted_Image_Type
source: Only image files of type jpg, png, gif, webp, and svg and are allowed.
de: Es sind nur Bilder vom Typ jpg, png, gif, webp und svg erlaubt.

# Culture_Name
source: '{0}' is not a valid value for a system language (CultureInfo).
de: '{0}' ist kein gültiger Name für eine Systemsprache (CultureInfo).

source: Uploaded_File_MaxSize_Exceeded
de: Die hochgeladene Datei überschreitet die erlaubte Größe

# Missing_Value_for_Valid_MultiLanguage_Json
source: Missing Value for Valid MultiLanguage Value
de: Fehlender Wert für das Multi-Sprachen Feld

# File_Upload_Failed
source: File upload failed '{0}'
de: Datei hochladen fehlgeschlagen '{0}'

# Required_File
source: The file is required.
de: Die Datei ist erforderlich.

# Invalid_Event_Visibility
source: No valid visibility for an event.
de: Kein gültiger Wert für die Sichtbarkeit eines Events.

# Resource_Does_Not_Exist
source: The resource '{0}' with ID '{1}' does not exist.
de: Die Resource '{0}' mit ID '{1}' exisitiert nicht.

# Contains_Invalid_Characters
source: {0} contains invalid characters
de: {0} enthält ungültige Zeichen
